from random import randint

# Заполните массив элементами арифметической прогрессии. Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.Каждое число вводится с новой строки.

# n = input("Введите числа типа 1 2 3, где 1 - первый элементь, 2 - разность, 3 - количество жлементов: ").split(' ')
# print(''.join("{0}\n".format(int(n[0])+i * int(n[1]))
#       for i in range(int(n[2]))).strip())

#  Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)

# print(k := [randint(5, 20) for i in range(randint(5, 20))])
# num = input(
#     "Введите диапозон 1 2, где 1 - начало диапазона, 2 - начало диапазона: ").split(' ')

# print([i for i in range(len(k)) if int(num[0]) < k[i] < int(num[1])])
